000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. hello.
000300 ENVIRONMENT DIVISION.
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION.
000600 01 NAME PIC X(15).
000700 01  DOCTOR.
000800   03  DOCTNAME        PIC X(20).
000900   03  DOCT-ADDRESS      PIC X(30).
001000   03  DOCT-PHONE        PIC X(10).
001100   03  SPECIALT        PIC X(20).
001200 PROCEDURE DIVISION.
001300     DISPLAY 'Whats your name? '.
001400     ACCEPT DOCTNAME.
001600     ACCEPT DOCT-ADDRESS.
001700     ACCEPT DOCT-PHONE.
001800     ACCEPT SPECIALT.
001900     DISPLAY "hello ", DOCTOR, "!".
002000     STOP RUN.